#include <stdio.h>
#include <conio.h>
#include <stdlib.h>
int main()
{
	printf("Hello World！\n");//"\n"是一个转义字符，表示回车换行
	//*********************************************************暂停方法**********************************************************
	//getchar();//要求输入任一字符，以达到暂停程序防止自动退出目的
	//getch();//暂停法一,需要conio.h，貌似有点问题
	//getchar()和getch()基本用法一致,差别是getch直接从键盘获取键值,不等待用户按回车,只要用户按一个键,getch就立刻返回
	//wait(10000);
	system("pause 10");//使用系统cmd语句pause,使用system需要包含头stdlib.h
	//*********************************************************暂停方法**********************************************************
	//*********************************************************调用CMD**********************************************************
	//system("ipconfig");
	system("echo I love Windows!");//system简单说就是调用系统power shell或cmd！！！,无缝结合仍需调试
	system("pause");//最爱暂停！！！
	//*********************************************************调用CMD**********************************************************
	return 0;
}