#pragma once
//万恶的水印,啦啦啦,BruceWangne,2018.01.24
//头部注释为代码说明部分,可自由发挥
//first c
//基本框架取自C primer plus 第二章历程, 以后的代码均须以此为模板!
#define _CRT_SECURE_NO_WARNINGS//用于注释fopen的报错
#include <stdio.h>//基本头
#include <conio.h>//初见于getch,未调试好
#include <stdlib.h>//初见于system
#include <windows.h> //初见于sleep

#include<dos.h> 

//_________________________________________________________1.plus函数_________________________________________________________//
double plus(double a)
{
	if (a > 0)
		return(a);
	else
		return(0.0);
}
//_________________________________________________________1.plus函数_________________________________________________________//

//_________________________________________________________2.integerpart函数_________________________________________________________//
double intprt(double a)
{
	return((int)a);
}
//_________________________________________________________2.integerpart函数_________________________________________________________//

//_________________________________________________________3.total函数_________________________________________________________//
double total(double x[], int n)
{
	int i;
	double sum;
	sum = 0;
	i = 0;
	for (i = 1; i <= n; i++)
	{
		sum += x[i];
	}
	return(sum);
}
//_________________________________________________________3.total函数_________________________________________________________//